Hello @danischm 

i think, even i am not able to recreate if I push all parameters at once.

what I am doing is.

Firstly, create the policy without the parameters advertise_hub_tlocs, all_hubs_are_equal and tloc_list_id.

Then I try to add these 3 variables to the policy and encounter error.

Both parts of the policy were created by the newer Provider version.


```
Terraform will perform the following actions:

  # module.sdwan.sdwan_hub_and_spoke_topology_policy_definition.hub_and_spoke_topology_policy_definition["HST_DEFINITION_T3-rrahimm"] will be created
  + resource "sdwan_hub_and_spoke_topology_policy_definition" "hub_and_spoke_topology_policy_definition" {
      + description      = "HST_DEFINITION_T3-rrahimm"
      + id               = (known after apply)
      + name             = "HST_DEFINITION_T3-rrahimm"
      + topologies       = [
          + {
              + name   = "group1"
              + spokes = [
                  + {
                      + hubs              = [
                          + {
                              + site_list_id      = "6b18c5c7-45a6-4b59-9f77-e2e9fcc4ae64"
                              + site_list_version = 0
                            },
                        ]
                      + site_list_id      = "8a84db66-2aba-462e-bfa8-ff9e9924515b"
                      + site_list_version = 0
                    },
                ]
            },
        ]
      + type             = (known after apply)
      + version          = (known after apply)
      + vpn_list_id      = "5e94d34c-8c88-4a49-980b-89265ba4e6ae"
      + vpn_list_version = 0
    }
    
    
    
    erraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.sdwan.sdwan_hub_and_spoke_topology_policy_definition.hub_and_spoke_topology_policy_definition["HST_DEFINITION_T3-rrahimm"] will be updated in-place
  ~ resource "sdwan_hub_and_spoke_topology_policy_definition" "hub_and_spoke_topology_policy_definition" {
        id               = "615e5395-aa22-44c5-8093-3d3c8e58d075"
        name             = "HST_DEFINITION_T3-rrahimm"
      ~ topologies       = [
          ~ {
              + advertise_hub_tlocs = true
              + all_hubs_are_equal  = true
                name                = "group1"
              + tloc_list_id        = "e5439673-0973-40d5-a378-165ad63d35af"
                # (1 unchanged attribute hidden)
            },
        ]
      ~ type             = "hubAndSpoke" -> (known after apply)
      ~ version          = 0 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
module.sdwan.sdwan_hub_and_spoke_topology_policy_definition.hub_and_spoke_topology_policy_definition["HST_DEFINITION_T3-rrahimm"]: Modifying... [id=615e5395-aa22-44c5-8093-3d3c8e58d075]
╷
│ Error: Provider returned invalid result object after apply
│ 
│ After the apply operation, the provider still indicated an unknown value for
│ module.sdwan.sdwan_hub_and_spoke_topology_policy_definition.hub_and_spoke_topology_policy_definition["HST_DEFINITION_T3-rrahimm"].type. All
│ values must be known after apply, so this is always a bug in the provider and should be reported in the provider's own repository. Terraform
│ will still save the other known object values in the state.
```